#include "reg52.h"	
#include "main.h"

/*******************************************************************************
* 函数名         :UsartInit()
* 函数功能		   :设置串口
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/
void UsartInit()
{
	SCON=0X50;			//设置为工作方式1
	TMOD=0X20;			//设置计数器工作方式2
	PCON=0X80;			//波特率加倍
	TH1=0XF3;				//计数器初始值设置，注意波特率是4800的
	TL1=0XF3;
	ES=1;						//打开接收中断
	EA=1;						//打开总中断
	TR1=1;					//打开计数器
}

//void Usart() interrupt 4
//{
//	u8 receiveData;

//	receiveData=SBUF;//出去接收到的数据
//	RI = 0;//清除接收中断标志位
//	SBUF=receiveData;//将接收到的数据放入到发送寄存器
//	while(!TI);			 //等待发送数据完成
//	TI=0;						 //清除发送完成标志位
//}